{
  "Apple___Apple_scab": "Apply fungicides containing captan, myclobutanil, or sulfur. Prune trees to improve air circulation. Remove and destroy fallen leaves and infected fruit. Plant scab-resistant apple varieties. Apply preventive sprays from green tip through petal fall.",
  "Apple___Black_rot": "Prune out dead or diseased branches during dormant season. Remove mummified fruits from the tree and ground. Apply fungicides like captan or thiophanate-methyl during the growing season. Maintain good tree vigor through proper fertilization and watering.",
  "Apple___Cedar_apple_rust": "Remove nearby juniper or cedar trees if possible. Apply fungicides containing myclobutanil, propiconazole, or sulfur from pink bud stage through petal fall. Plant rust-resistant apple varieties. Scout for orange gelatinous galls on cedar trees in spring.",
  "Corn___Cercospora_leaf_spot Gray_leaf_spot": "Rotate crops to non-host plants for at least one year. Plant resistant hybrids. Apply foliar fungicides containing strobilurins or triazoles when conditions favor disease. Till crop residue to speed decomposition.",
  "Corn___Common_rust": "Plant resistant hybrids. Apply fungicides containing strobilurins, triazoles, or chlorothalonil when pustules first appear. Scout fields regularly during warm, humid weather. Maintain good plant nutrition.",
  "Corn___Northern_Leaf_Blight": "Use resistant hybrids. Rotate with non-host crops. Apply foliar fungicides when lesions first appear on lower leaves. Till under crop debris to reduce overwintering inoculum.",
  "Grape___Black_rot": "Remove and destroy mummified berries and infected canes. Apply fungicides like myclobutanil or mancozeb from bud break through fruit set. Ensure good air circulation through proper pruning and canopy management.",
  "Grape___Esca_(Black_Measles)": "No cure exists; manage by pruning out infected wood during dormancy. Apply wound protectants after pruning. Remove severely infected vines. Maintain plant vigor through proper irrigation and nutrition.",
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Apply fungicides containing copper or mancozeb. Improve air circulation through pruning. Remove infected leaves and debris. Avoid overhead irrigation.",
  "Orange___Haunglongbing_(Citrus_greening)": "No cure exists. Remove and destroy infected trees. Control Asian citrus psyllid vectors with insecticides. Plant certified disease-free nursery stock. Apply nutritional sprays to maintain tree health.",
  "Peach___Bacterial_spot": "Plant resistant varieties. Apply copper-based bactericides during dormant season. Avoid overhead irrigation. Remove and destroy infected plant material. Maintain good orchard sanitation.",
  "Squash___Powdery_mildew": "Apply fungicides containing sulfur, potassium bicarbonate, or neem oil. Improve air circulation by proper spacing. Water at the base of plants. Remove and destroy infected leaves. Plant resistant varieties.",
  "Strawberry___Leaf_scorch": "Remove and destroy infected leaves. Apply fungicides containing copper or captan. Avoid overhead irrigation. Maintain proper plant spacing for air circulation. Renovate beds after harvest.",
  "Potato___Early_blight": "Prune or stake plants to improve air circulation and reduce fungal problems. Make sure to disinfect your pruning shears (one part bleach to 4 parts water) after each cut. Keep the soil under plants clean and free of garden debris. Add a layer of organic compost to prevent the spores from splashing back up onto vegetation. Drip irrigation and soaker hoses can be used to help keep the foliage dry. For best control, apply copper-based fungicides early, two weeks before disease normally appears or when weather forecasts predict a long period of wet weather. Alternatively, begin treatment when disease first appears, and repeat every 7-10 days for as long as needed.",
  "Potato___Late_blight": "Plant resistant cultivars when available. Remove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation. Water in the early morning hours, or use soaker hoses, to give plants time to dry out during the day — avoid overhead irrigation. Destroy all tomato and potato debris after harvest.",
  "Tomato___Early_blight": "Use pathogen-free seed, or collect seed only from disease-free plants. Rotate out of tomatoes and related crops for at least two years. Control susceptible weeds such as black nightshade and hairy nightshade, and volunteer tomato plants throughout the rotation. Fertilize properly to maintain vigorous plant growth. Avoid working in plants when they are wet. Use drip irrigation instead of overhead irrigation to keep foliage dry.",
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "The most effective treatments used to control the spread of TYLCV are insecticides and resistant crop varieties. Symptomatic plants should be carefully covered by a clear or black plastic bag and tied at the stem at soil line. Remove and destroy infected plants promptly.",
  "Tomato___Bacterial_spot": "Using pathogen-free seed and disease-free transplants is the best way to avoid bacterial spot on tomato. Avoid sprinkler irrigation and cull piles near greenhouse or field operations, and rotate with a nonhost crop.",
  "Tomato___Leaf_Mold": "Let plants air out and dry. If cultivated in a greenhouse, expose them to dry air conditions. Keep leaves dry when watering - water in the early morning hours. Use drip irrigation methods to water the soil without wetting the leaves.",
  "Tomato___Target_Spot": "Remove old plant debris at the end of the growing season. Rotate crops and don't plant tomatoes in areas where disease-prone plants have been located in the past year. Pay careful attention to air circulation. Grow plants in full sunlight. Cage or stake tomato plants to keep them above the soil.",
  "Tomato___Spider_mites Two-spotted_spider_mite": "Apply a miticide specific to mites. Start treating before plants are seriously damaged. Apply the miticide every 7 days or so. Switch to another type of miticide after three applications to prevent resistance.",
  "Tomato___Tomato_mosaic_virus": "Use ToMV-resistant varieties. Avoid planting in soil from previous infected crops. Steam sterilize potting soil and containers. Wash hands with soap and water before handling plants. Sterilize pruning utensils.",
  "Tomato___Septoria_leaf_spot": "Remove infected leaves immediately. Wash hands and pruners thoroughly before working with uninfected plants. Apply fungicides containing copper or potassium bicarbonate. Begin spraying as soon as first symptoms appear.",
  "Tomato___Late_blight": "Plant resistant cultivars when available. Remove volunteers and space plants for good air circulation. Water in early morning hours. Destroy all tomato and potato debris after harvest. Apply copper-based fungicide every 7 days or less.",
  "Cherry___Powdery_mildew": "Plant resistant cultivars in sunny locations. Prune to improve air circulation. Disinfect pruning tools. Remove diseased foliage and clean up fallen debris. Use mulch to prevent spore splashing. Apply milk sprays (40% milk, 60% water) every 10-14 days. Use neem oil on a 7-day schedule.",
  "Pepper___Bacterial_spot": "Treat seeds with sodium hypochlorite. Inspect transplants regularly to identify symptomatic seedlings. Remove and destroy or treat transplants with symptoms. Use products containing plant-growth-promoting rhizobacteria or biological agents."
}
